using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace EtrendImport
{
    public class mapping
    {
        public string c_name { get; set; }
        public string field_type { get; set; }
        public string e_name { get; set; }
        public string new_name { get; set; }

        public static string GetFRGCHKSql(string[] p_values)
        {
            return string.Format(@"
insert into frgchk values('{0}','1','招募核准函','','發函日期', {4},'承接日', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','2','原招募核准函','','發函日期', {4},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','3','離境申請入境簽證函','','發函日期', {4},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','4','意外險保險號碼','','保險日期', {4},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','5','展延核准函','','發函日期', {4},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','6','居留證函號',{1},'發證日期',{2},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','7','聘可函號','','發函日期',{3},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','8','6月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','9','12月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','10','居留證一展函號','','發證日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','11','18月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','12','展延聘可函號','','發函日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','13','24月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','14','居留證二展函號','','發證日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','15','30月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','16','再展延聘可函號','','發函日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','17','36月核備函號','','發函日期', {4},'體檢日期', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','18','居留證三展函號','','發證日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','19','離境核備函','','發證日期', {4},'工作期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','20','報逃函號','','發函日期', {4},'有效期限', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','22','異動核准函','','發函日期', {4},'', {4}, {4}, {4},'', {4},'')
insert into frgchk values('{0}','23','入境通報','','', {4},'', {4}, {4}, {4},'', {4},'')",p_values);
            /*
            return string.Format(@"
insert into frgchk values('{0}','1','招募核准函','','發函日期',{^1900-01-01},'承接日',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','2','原招募核准函','','發函日期',{^1900-01-01},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','3','離境申請入境簽證函','','發函日期',{^1900-01-01},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','4','意外險保險號碼','','保險日期',{^1900-01-01},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','5','展延核准函','','發函日期',{^1900-01-01},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','6','居留證函號',{1},'發證日期',{2},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','7','聘可函號','','發函日期',{3},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','8','6月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','9','12月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','10','居留證一展函號','','發證日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','11','18月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','12','展延聘可函號','','發函日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','13','24月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','14','居留證二展函號','','發證日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','15','30月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','16','再展延聘可函號','','發函日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','17','36月核備函號','','發函日期',{^1900-01-01},'體檢日期',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','18','居留證三展函號','','發證日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','19','離境核備函','','發證日期',{^1900-01-01},'工作期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','20','報逃函號','','發函日期',{^1900-01-01},'有效期限',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','22','異動核准函','','發函日期',{^1900-01-01},'',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
insert into frgchk values('{0}','23','入境通報','','',{^1900-01-01},'',{^1900-01-01},{^1900-01-01},{^1900-01-01},'',{^1900-01-01},'')
",p_values);
             */ 
        }
    }

    

}
